# =====================================================
# 1. 清理 & 建库
# =====================================================
vdel -all
vlib work
vmap work work

# =====================================================
# 2. 编译源文件 (RTL 在 src，TB 在 sim)
# =====================================================
# RTL 文件
vlog ../src/Sync.v
vlog ../src/DeSync.v
vlog ../src/gtwizard_ultrascale_0_prbs_any.v
#ip 文件
vlog ../src/dec_fifo_8w_8r.v
vlog ../src/fifo_32w_8r.v
# Testbench 文件
vlog ../sim/loopback_tb.v

# =====================================================
# 3. 仿真启动
# =====================================================
vsim -gui -voptargs="+acc" work.loopback_tb \
     -L fifo_generator_v13_2_11 \
     -L xpm


# =====================================================
# 4. 配置波形显示
# =====================================================
# 显示完整信号名
configure wave -signalnamewidth 1

# 添加模块信号到波形窗口
# 注意：实例名必须和 testbench 中的实例一致
add wave -r sim:/loopback_tb/*
# =====================================================
# 5. 运行仿真
# =====================================================
run 10us
